{
    "header": {
        "name": "Alexandre Martins Paiva",
        "roles": [
            "Engineering Manager",
            "Senior Backend Engineer"
        ],
        "email": "ampaiva@gmail.com",
        "phone": "+5531988122060",
        "location": {
            "geo": "-19.4583,-44.2412?q=Sete%20Lagoas,%20MG,%20Brazil",
            "display": "Brazil"
        }
    },
    "sections": {
        "objective": "To leverage my skills and contribute effectively to a dynamic organization, where I can continuously enhance my abilities, collaborate with a diverse team, and drive impactful results.",
        "skills": [
            [
                "Engineering Management",
                85
            ],
            [
                "Team Building",
                95
            ],
            [
                "Software Development",
                95
            ],
            [
                "C++",
                95
            ],
            [
                "Java",
                98
            ],
            [
                "Python",
                90
            ],
            [
                "Django",
                80
            ],
            [
                "Embedded Systems",
                70
            ],
            [
                "Agile Methodologies",
                90
            ],
            [
                "Portuguese",
                100
            ],
            [
                "English",
                90
            ]
        ],
        "experiences": [
            {
                "company": {
                    "name": "Loadsmart",
                    "hint": "[Loadsmart](https://loadsmart.com) is a startup founded in 2014 and based in Chicago. They provide logistic services for the US and Canadian markets acting as a broker, connecting shippers with carriers. Loadsmart also has a division that provides SaaS for the logistics industry."
                },
                "start": "10/2019",
                "end": "04/2023 (4y 3m)",
                "roles": [
                    "Engineering Manager",
                    "Tech Lead",
                    "Senior Backend Developer"
                ],
                "paragraphs": [
                    {
                        "subtitle-highlight": "People Management",
                        "text": "Managed two teams simultaneously. Mentored individual contributors daily and regular 1:1s, providing positive and growth feedback regularly. Delivered performance reviews two times per year for each direct report. Properly allocated people on the right projects and roles to create evidence for promotion and merit increase.",
                        "tags": [
                            "engineering management"
                        ],
                        "activities": [
                            "Managed 17 developers with ~90% of retention",
                            "Promoted 8 direct reports, including the first company Staff Engineer"
                        ]
                    },
                    {
                        "subtitle-highlight": "Technical Management",
                        "tags": [
                            "engineering management"
                        ],
                        "activities": [
                            {
                                "description": "Led Agile ceremonies such as daily meetings, sprint planning, and retrospectives",
                                "tags": [
                                    "agile methodologies"
                                ]
                            },
                            "Planned with Product Manager the roadmap, prioritizing the order of the features to be delivered",
                            "Creation of technical documents related to coding best practices",
                            "Propose and discuss architectural decisions regarding product features",
                            "Code reviews",
                            {
                                "description": "Product features development using Python and Django",
                                "tags": [
                                    "python", "django"
                                ]
                            },
                            "Product features development using Python and Django",
                            "Creation of dashboards for making decisions based on data analysis (SQL)"
                        ],
                        "paragraph": "Delivered a custom price ceiling based on industry benchmarks set, assuring that enterprise shippers don’t receive prices above a threshold. This project was published on the [company blog](https://blog.loadsmart.com/2021/10/22/put-bumpers-on-dynamic-pricing-roll-with-adaptive-price-ceiling-guardrails-for-enterprise-shippers) and Linkedin."
                    }
                ]
            },
            {
                "company": {
                    "name": "Crossover",
                    "hint": "Crossover is one of the companies of [ESW Capital](https://www.linkedin.com/company/eswcapital/about/). Based in Austin, Texas, the ESW Capital group specifically focuses on buying, strengthening, and then growing mature business software companies."
                },
                "start": "04/2016",
                "end": "10/2019 (3y 7m)",
                "roles": [
                    "Senior Backend Developer"
                ],
                "paragraphs": {
                    "activities": [
                        "Aurea: Maintenance of Java Systems responsible for exchanging Electronic Data Interchange (EDI)",
                        "Trilogy: Migration of source code from different Version Control Systems to Github",
                        "Optiva: Maintenance and development of new features for Optiva Business Support Systems (BSS) solutions Java development for telephony billing. Development using a proprietary language and platform to process billing scenarios for the telecommunications industry"
                    ],
                    "tags": [
                        "java"
                    ]
                }
            },
            {
                "company": {
                    "name": "FITec",
                    "hint": "Created in the 1990s, [FITec](https://fitec.org.br/home) is an Institute of Science and Technology (ICT) accredited by various Brazilian bodies, qualified to enter into agreements with companies benefiting from the Laws of Incentive to Research and Technological Development.<p>Its staff has about 350 employees, consisting of doctors, post-doctors, masters, postgraduates, graduates and technicians, with extensive market experience and great qualification in the areas of Digital Transformation, Artificial Intelligence, Data Science, IoT , Management, Industrial Design and Production Engineering, distributed between Recife, Campinas, São José dos Campos, Belo Horizonte and Manaus.<p>This team, working alone or together with teams of partners from different parts of the world, has developed Hardware, Firmware and Software projects in recent years in the areas of: Telecommunications, IT, Electric Energy, Biomedical Equipment, Industrial Automation (4.0), Technologies Assistive Services, Automotive Industry and Logistics."
                },
                "start": "06/2008",
                "end": "06/2015 (7y 1m)",
                "roles": [
                    "Senior Backend Developer"
                ],
                "paragraph": "Development of IT systems focused on telecommunication and IPTV. The main languages used are Java, C++, and C",
                "paragraphs": {
                    "activities": [
                        {
                            "description": "3 months in Montreal (Canada) developing solutions for IPTV (Ericsson)",
                            "tags": [
                                "java"
                            ]
                        },
                        {
                            "description": "1 month in New Delhi (India) deploying systems for Ericsson customers",
                            "tags": [
                                "java"
                            ]
                        },
                        {
                            "description": "1 month in Atlanta-GE (USA) developing solutions for Content Management System (Ericsson)",
                            "tags": [
                                "java"
                            ]
                        },
                        {
                            "description": "2 months in Shanghai (China) as a member of the A7515 development team, an Alcatel-Lucent NGN gateway using protocols R2, ISDN, and SIP",
                            "tags": [
                                "c++",
                                "c"
                            ]
                        }
                    ]
                }
            },
            {
                "company": {
                    "name": "ATAN",
                    "hint": "Development of IT systems mainly using Java and J2EE application servers, attending customers such as [Arcelor-Mittal](www.arcelormittal.com)"
                },
                "start": "08/2005",
                "end": "09/2006 (1y 2m)",
                "roles": [
                    "Senior Backend Developer",
                    "Project Lead"
                ],
                "paragraphs": {
                    "activities": [
                        "Tech Lead of a team responsible for migrating Level 2 messages from a legacy Cobol system to a J2EE platform. This was a mission-critical system that transported in real-time low-level messages of steelworks operation such as temperature, humidity, measurement of chemical elements, etc.. to be analyzed higher-level systems and determined the actions to be taken. Therefore, the migration had to be rigorously tested before switching between the systems",
                        "Collected with stakeholders the requirements for building a system that manages ships with coal for the steelworks operation"
                    ],
                    "tags": [
                        "java"
                    ]
                }
            },
            {
                "company": {
                    "name": "FITec",
                    "hint": "Created in the 1990s, [FITec](https://fitec.org.br/home) is an Institute of Science and Technology (ICT) accredited by various Brazilian bodies, qualified to enter into agreements with companies benefiting from the Laws of Incentive to Research and Technological Development.<p>Its staff has about 350 employees, consisting of doctors, post-doctors, masters, postgraduates, graduates and technicians, with extensive market experience and great qualification in the areas of Digital Transformation, Artificial Intelligence, Data Science, IoT , Management, Industrial Design and Production Engineering, distributed between Recife, Campinas, São José dos Campos, Belo Horizonte and Manaus.<p>This team, working alone or together with teams of partners from different parts of the world, has developed Hardware, Firmware and Software projects in recent years in the areas of: Telecommunications, IT, Electric Energy, Biomedical Equipment, Industrial Automation (4.0), Technologies Assistive Services, Automotive Industry and Logistics."
                },
                "start": "05/2000",
                "end": "08/2005 (5y 4m)",
                "roles": [
                    "Senior Backend Developer"
                ],
                "paragraphs": {
                    "activities": [
                        "Development of IT systems focused on telecommunication. The main languages used were C++ and C",
                        "2 months in Naperville-IL (USA) for testing CALEA feature of iGEN, a Lucent Technologies class 5 switch",
                        "8 months in Phoenix-AZ (USA) as a member of the iMerge development team, a Lucent Technologies voice-over IP platform using protocols H.323 and NCS"
                    ],
                    "tags": [
                        "c++",
                        "c",
                        "english"
                    ]
                }
            }
        ],
        "education": [
            {
                "company": {
                    "name": "UFMG",
                    "hint": "[Universidade Federal de Minas Gerais](https://ufmg.br/)"
                },
                "roles": [
                    "Master's Degree",
                    "Computer Science"
                ],
                "start": "2013",
                "end": "2015",
                "paragraphs": [
                    {
                        "subtitle-highlight": "Thesis",
                        "description": "Proposed a new method for code clone detection. As proof of concept, I developed a complete [Java system](https://github.com/ampaiva/mcsheep) to parse Java projects in search of code clones.",
                        "tags": [
                            "software engineering",
                            "java"
                        ]
                    }
                ]
            },
            {
                "company": {
                    "name": "UFMG",
                    "hint": "[Universidade Federal de Minas Gerais](https://ufmg.br/)"
                },
                "roles": [
                    "Bacharelor",
                    "Electrical Engineer"
                ],
                "activities": []
            }
        ]
    }
}